Documents/ЗаполнениеСудебныхУчастковДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаполнениеСудебныхУчастковДолжников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСтатусаЗаполненияСУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СудебныйУчасток</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СудебныеУчастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФорматАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФормата</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидФорматаАдресаСУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыТипаСтрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыТипаСтрока</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПутьКФайлу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресФИАС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидСтатусаЗаполненияСУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидСтатусаЗаполненияСУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправкеКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученВСервисе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученКлиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Comment>Трейд Софт</Comment>
			<Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
				<v8:Type>cfg:DocumentRef.РеструктуризацияМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Судьи</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеУчастки</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.тсЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Банки</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
				<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентовУЭД</v8:Type>
				<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
				<v8:Type>cfg:DocumentRef.ДоговорМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
				<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>6</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТипаСтрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочникВладелец</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемоеЗначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователейДоступность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Documents/ЗаполнениеСудебныхУчастковДолжников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПослеПодбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ЗаполнениеСудебныхУчастковДолжников", "");
	ОткрытьФорму("Обработка.ПодборДО.Форма.ФормаДинамическийСписок",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПослеПодбора(РезультатЗакрытия,Параметры) Экспорт	
	ЗаполнитьАдресаДолжников();
	ЗаполнитьСУДолжников();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаДолжников()
	ПВХСУ = Константы.АдресДляСудебногоУчастка.Получить();
	ВладелецПВХАдреса = ПВХСУ.СправочникВладелец;
	Если ВладелецПВХАдреса = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого Элемент Из Объект.Объекты Цикл
			Должник = Элемент.Объект.Должник;
			Элемент.Адрес = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.АдресДляСудебногоУчастка.Получить().Код); 
			Элемент.Должник = Должник; 
		КонецЦикла;
	Иначе
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.Адрес = ОбъектыСервер.ПолучитьЗначениеСвойства(Элемент.Объект,Константы.АдресДляСудебногоУчастка.Получить().Код);
			Элемент.Должник = Элемент.Объект.Должник;
		КонецЦикла;	
	КонецЕсли;	
	
	Если ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.АдресФИАС Тогда
		Для Каждого Элемент Из Объект.Объекты Цикл
			Если ЗначениеЗаполнено(Элемент.Адрес) Тогда
				СтруктураJSON = бит_ИнтеграцияПочтаРФ.ПолучитьСтруктуруАдреса(Элемент.Адрес);
				Элемент.Адрес = Строка(СтруктураJSON.value);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.Адрес = бит_АдресныйКлассификатор.ПолучитьЧастьАдресаИзКЛАДР(Элемент.Адрес,"Представление");
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСУДолжников()	
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого Элемент Из Объект.Объекты Цикл
			Должник = Элемент.Объект.Должник;
			Элемент.СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.СудебныйУчастокОбъекта.Получить().Код); 
		КонецЦикла;
	Иначе
		Для Каждого Элемент Из Объект.Объекты Цикл
			Элемент.СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Элемент.Объект,Константы.СудебныйУчастокОбъекта.Получить().Код); 
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПользовательУслуги) Тогда
		ПользовательУслуги = Константы.СервисСУЛогин.Получить();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус = Перечисления.ВидСтатусаЗаполненияСУ.ВПодготовке;
	ИначеЕсли Объект.Статус <> Перечисления.ВидСтатусаЗаполненияСУ.ВПодготовке Тогда
		Элементы.ОбъектыУдалитьОбъектыСУ.Видимость = Ложь;
		ТолькоПросмотрСИсключением();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТолькоПросмотрСИсключением()
	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") ИЛИ ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Истина;
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
			Элемент.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	Элементы.Объекты.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыПометка.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыСудебныйУчасток.ТолькоПросмотр = Ложь;
	Элементы.ОбъектыУстановитьФлажки.Доступность = Истина;
	Элементы.ОбъектыСнятьФлажки.Доступность = Истина;
	Элементы.ОбъектыПрименитьСудебныеУчастки.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектыСУ(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеУдалитьОбъектыСУ",ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Удалить объекты с заполненным судебным участком?",РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдалитьОбъектыСУ(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбТЧ = Объект.Объекты;
		Сч = ОбТЧ.Количество()-1;
		Пока Сч >= 0 Цикл
			ТекСтрока = ОбТЧ.Получить(Сч);
			Если ЗначениеЗаполнено(ТекСтрока.СудебныйУчасток) Тогда
				ОбТЧ.Удалить(Сч);
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСервис(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеОтправитьВСервис",ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Отправить запрос в сервис? (после документ будет нельзя изменить!!!)",РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправитьВСервис(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменитьСтатусНаОтправленКлиент();
 		ТолькоПросмотрСИсключением();
		СервисСудебныеУчастки.ФоновоеЗаданиеСервис_СудебныеУчастки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусНаОтправленКлиент()
	Объект.Статус = Перечисления.ВидСтатусаЗаполненияСУ.КОтправкеКлиент;
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура ПрименитьСудебныеУчасткиНаСервере()
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	мУстановитьУчастки = Объект.Объекты.НайтиСтроки(Новый Структура("Пометка",Истина));
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Для Каждого СУ Из мУстановитьУчастки Цикл
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СУ.Должник,Константы.СудебныйУчастокОбъекта.Получить().Код,СУ.СудебныйУчасток);			
		КонецЦикла;
	Иначе
		Для Каждого СУ Из мУстановитьУчастки Цикл
			ОбъектыСервер.ЗаписатьЗначениеСвойства(СУ.Объект,Константы.СудебныйУчастокОбъекта.Получить().Код,СУ.СудебныйУчасток);			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьСудебныеУчастки(Команда)
	ПрименитьСудебныеУчасткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	 ТекущиеДанные = Элементы.Объекты.ТекущиеДанные;
	 ТекущиеДанные.Должник = ПолучитьДолжникаПоДОНаСервере(ТекущиеДанные.Объект);
	 ТекущиеДанные.СудебныйУчасток = ПолучитьСУПоДОНаСервере(ТекущиеДанные.Объект);
	 ТекущиеДанные.Адрес = ПолучитьАдресПоДОНаСервере(ТекущиеДанные.Объект);
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжникаПоДОНаСервере(ДО)
	Должник = ДО.Должник;
	Возврат Должник;				 
КонецФункции

&НаСервере
Функция ПолучитьСУПоДОНаСервере(ДО)
	ВладелецПВХСУ = Константы.СудебныйУчастокОбъекта.Получить().СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Должник = ДО.Должник;
		СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.СудебныйУчастокОбъекта.Получить().Код); 
	Иначе
		СудебныйУчасток = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,Константы.СудебныйУчастокОбъекта.Получить().Код); 
	КонецЕсли;	
	Возврат СудебныйУчасток;				 
КонецФункции

&НаСервере
Функция ПолучитьАдресПоДОНаСервере(ДО)
	ПВХСУ = Константы.АдресДляСудебногоУчастка.Получить();
	ВладелецПВХСУ = ПВХСУ.СправочникВладелец;
	Если ВладелецПВХСУ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты Тогда 
		Должник = ДО.Должник;
		АдресДляСудебногоУчастка = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,Константы.АдресДляСудебногоУчастка.Получить().Код); 
	Иначе
		АдресДляСудебногоУчастка = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,Константы.АдресДляСудебногоУчастка.Получить().Код); 
	КонецЕсли;	
	Если ЗначениеЗаполнено(АдресДляСудебногоУчастка) И ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.АдресФИАС Тогда
		СтруктураJSON = бит_ИнтеграцияПочтаРФ.ПолучитьСтруктуруАдреса(АдресДляСудебногоУчастка);
		АдресДляСудебногоУчастка = Строка(СтруктураJSON.value);	
	ИначеЕсли ПВХСУ.ВидСтроки = Перечисления.ВидыТипаСтрока.Адрес Тогда 
		АдресДляСудебногоУчастка = бит_АдресныйКлассификатор.ПолучитьЧастьАдресаИзКЛАДР(АдресДляСудебногоУчастка,"Представление");
	КонецЕсли;
	Возврат АдресДляСудебногоУчастка;				 
КонецФункции

&НаКлиенте
Процедура ОбъектыСудебныйУчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.ВидСтатусаЗаполненияСУ.ВПодготовке") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСудебныйУчастокОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ Объект.Статус = ПредопределенноеЗначение("Перечисление.ВидСтатусаЗаполненияСУ.ВПодготовке") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры
